frontend/controllers/CommessageController.php

    public function actionShow()
    {
        $arr = (new \yii\db\Query())
            ->select(['*'])
            ->from('al_com_message')
            ->all();
---
SELECT * FROM `al_com_message`

    public function actionOneupdate()
    {
        $request= Yii::$app->request;
        $mes_id=$request->post('mes_id');
        $ziduan=$request->post('ziduan');
        $value=$request->post('value');

        $connection = \Yii::$app->db;
        $res = $connection->createCommand()->update('al_com_message', ["$ziduan"=>$value], "mes_id=$mes_id")->execute();
---
UPDATE `al_com_message` SET `m_name`='打算打算dasdsadas' WHERE mes_id=103