frontend/controllers/CompanyController.php

    public function actionShow()
    {
        $arr = (new \yii\db\Query())
            ->select(['*'])
            ->from('al_company')
            ->all();
---
SELECT * FROM `al_company`