frontend/controllers/CompanyController.php

SELECT * FROM `al_com_message` INNER JOIN `al_company` ON al_com_message.com_id = al_company.com_id
SELECT * FROM `al_company` INNER JOIN `al_com_message` ON al_company.mes_id = al_com_message.mes_id
---
    public function actionShow()
    {
        $arr = (new \yii\db\Query())
            ->select(['*'])
            ->from('al_company')
            ->innerJoin('al_com_message', 'al_company.mes_id = al_com_message.mes_id')
            ->all();