frontend/controllers/CompanyController.php

UPDATE `al_company` SET `cou_id`=12 WHERE com_id in (14,15)
---
    public function actionAdd()
    {

        $request= Yii::$app->request;
        $data['cou_id']=$request->get('cou_id');
        $com_id=$request->get('com_id');
        //开始入库
        $connection = \Yii::$app->db;
        $re = $connection->createCommand()->update('al_company', $data, "com_id in ($com_id)")->execute();

SELECT * FROM `al_company` INNER JOIN `al_com_message` ON al_company.mes_id = al_com_message.mes_id LEFT JOIN `al_counselor` ON al_counselor.cou_id = al_company.cou_id
---
    public function actionShow()
    {
        $arr = (new \yii\db\Query())
            ->select(['*'])
            ->from('al_company')
            ->innerJoin('al_com_message', 'al_company.mes_id = al_com_message.mes_id')
            ->leftJoin('al_counselor', 'al_counselor.cou_id = al_company.cou_id')
            ->all();