frontend/controllers/KeywordController.php

    public function actionIndex()
    {
        $model = new Keyword();   //实例化model

        $request = Yii::$app->request;  //实例化请求处理
        if($request->isPost)
        {
            //接受数据
            $k_name=$request->post('k_name');
            $k_num=$request->post('k_num');
            //添加时间
            $k_addtime=date('Y-m-d H:i:s',time());

            //数据添加
            $model->k_name=$k_name;
            $model->k_num=$k_num;
            $model->k_addtime=$k_addtime;
            $re=$model->save();
---
INSERT INTO `al_keyword` (`k_name`, `k_num`, `k_addtime`) VALUES ('天王', 666, '2016-06-15 15:04:05')