frontend/controllers/RecruitController.php

SELECT COUNT(*) FROM `al_recruit` LEFT JOIN `al_com_message` ON al_com_message.mes_id = al_recruit.mes_id LEFT JOIN `al_generalize` ON al_generalize.gen_id = al_recruit.gen_id LEFT JOIN `al_generalize_type` ON al_generalize_type.g_type_id = al_recruit.g_type_id LEFT JOIN `al_place` ON al_place.pla_id = al_recruit.pla_id LEFT JOIN `al_post` ON al_place.pla_id = al_recruit.pla_id
SELECT (al_post.i_name) as p_name ,(al_place.i_name) as pl_name ,(al_recruit.rec_id) as recr_id  , `r_pay`, `r_describe`, `r_suffer`, `r_edu`, `r_language`, `r_major`, `r_iflogbook`, `r_age`, `r_sex`, `r_name`, `r_time`, `r_addtime`, `r_gen`, `r_status`,`m_name`,`g_price`,`g_type_name`
         FROM `al_recruit` LEFT JOIN `al_com_message` ON al_com_message.mes_id = al_recruit.mes_id LEFT JOIN `al_generalize` ON al_generalize.gen_id = al_recruit.gen_id LEFT JOIN `al_generalize_type` ON al_generalize_type.g_type_id = al_recruit.g_type_id LEFT JOIN `al_place` ON al_place.pla_id = al_recruit.pla_id LEFT JOIN `al_post` ON al_place.pla_id = al_recruit.pla_id LIMIT 5
---
    public function actionShow()
    {
        $query = (new \yii\db\Query())
            ->select(["(al_post.i_name) as p_name ,(al_place.i_name) as pl_name ,(al_recruit.rec_id) as recr_id  , `r_pay`, `r_describe`, `r_suffer`, `r_edu`, `r_language`, `r_major`, `r_iflogbook`, `r_age`, `r_sex`, `r_name`, `r_time`, `r_addtime`, `r_gen`, `r_status`,`m_name`,`g_price`,`g_type_name`
        "])
            ->from('al_recruit')
            ->leftJoin('al_com_message', 'al_com_message.mes_id = al_recruit.mes_id')
            ->leftJoin('al_generalize', 'al_generalize.gen_id = al_recruit.gen_id')
            ->leftJoin('al_generalize_type', 'al_generalize_type.g_type_id = al_recruit.g_type_id')
            ->leftJoin('al_place', 'al_place.pla_id = al_recruit.pla_id')
            ->leftJoin('al_post', 'al_place.pla_id = al_recruit.pla_id');

                //print_r($query);die;

            $countQuery = clone $query;
            $pages = new Pagination(['totalCount' => $countQuery->count(),'pageSize'=>'5']);

            $models = $query->offset($pages->offset)
                ->limit($pages->limit)
                ->all();

DELETE FROM `al_recruit` WHERE rec_id in (54)
SELECT (al_post.i_name) as p_name ,(al_place.i_name) as pl_name ,(al_recruit.rec_id) as recr_id  , `r_pay`, `r_describe`, `r_suffer`, `r_edu`, `r_language`, `r_major`, `r_iflogbook`, `r_age`, `r_sex`, `r_name`, `r_time`, `r_addtime`, `r_gen`, `r_status`,`m_name`,`g_price`,`g_type_name`
                     FROM `al_recruit` LEFT JOIN `al_com_message` ON al_com_message.mes_id = al_recruit.mes_id LEFT JOIN `al_generalize` ON al_generalize.gen_id = al_recruit.gen_id LEFT JOIN `al_generalize_type` ON al_generalize_type.g_type_id = al_recruit.g_type_id LEFT JOIN `al_place` ON al_place.pla_id = al_recruit.pla_id LEFT JOIN `al_post` ON al_place.pla_id = al_recruit.pla_id WHERE al_recruit.rec_id>50 LIMIT 1
---
    public function actionDelete()
    {

        $request= Yii::$app->request;
        if(Yii::$app->request->isPost){
                //批量删除
                $rec_id=$request->post('rec_id');
                $last_id=$request->post('last_id');
                $connection = \Yii::$app->db;
                $num=$connection->createCommand()->delete('al_recruit', "rec_id in ($rec_id)")->execute();
                  if($num)
                  {
                    // 此时删除成功,许查询出部分数据进行填补
                    $arr = (new \yii\db\Query())
                    ->select(["(al_post.i_name) as p_name ,(al_place.i_name) as pl_name ,(al_recruit.rec_id) as recr_id  , `r_pay`, `r_describe`, `r_suffer`, `r_edu`, `r_language`, `r_major`, `r_iflogbook`, `r_age`, `r_sex`, `r_name`, `r_time`, `r_addtime`, `r_gen`, `r_status`,`m_name`,`g_price`,`g_type_name`
                    "])
                    ->from('al_recruit')
                    ->leftJoin('al_com_message', 'al_com_message.mes_id = al_recruit.mes_id')
                    ->leftJoin('al_generalize', 'al_generalize.gen_id = al_recruit.gen_id')
                    ->leftJoin('al_generalize_type', 'al_generalize_type.g_type_id = al_recruit.g_type_id')
                    ->leftJoin('al_place', 'al_place.pla_id = al_recruit.pla_id')
                    ->leftJoin('al_post', 'al_place.pla_id = al_recruit.pla_id')
                    ->where("al_recruit.rec_id>$last_id")
                    ->limit($num)
                    ->all();

UPDATE `al_recruit` SET `r_major`='1' WHERE rec_id=52
---
    public function actionOneupdate()
    {
        $request= Yii::$app->request;
        $rec_id=$request->post('rec_id');
        $ziduan=$request->post('ziduan');
        $value=$request->post('value');

        $connection = \Yii::$app->db;
        $res = $connection->createCommand()->update('al_recruit', ["$ziduan"=>$value], "rec_id=$rec_id")->execute();