admin/frontend/controllers/AdminController.php

SELECT * FROM `al_admin`
---
    public function actionShow()
    {
        $rows = (new \yii\db\Query())
            ->select(['*'])
            ->from('al_admin')
            ->all();

SELECT `pri_id` FROM `al_admin_privilege` WHERE `adm_id`='2'
---
	 public function actionEmpower()
	 {
		$request = Yii::$app->request;
		$adm_id = $request->get('id');
		$arr = $this->classify('al_privilege','p_pid');
		$row = (new \yii\db\Query())
                        ->select(['pri_id'])
                        ->from('al_admin_privilege')
                        ->where(['adm_id' =>$adm_id])
                       ->all();