admin/frontend/controllers/CommessageController.php

SELECT * FROM `al_com_message`
---
    public function actionShow()
    {
        $arr = (new \yii\db\Query())
            ->select(['*'])
            ->from('al_com_message')
            ->all();