admin/frontend/controllers/LoginController.php

SELECT * FROM `al_admin` WHERE (`a_account`='huxuebao') AND (`a_pwd`='e10adc3949ba59abbe56e057f20f883e')
---
     public function actionSelect1()

    {
        //echo "11111";die;
        $connection = \Yii::$app->db;
        $request = Yii::$app->request;
                        $name= $request->post('name');
                         $pwd= md5($request->post('pwd'));
                        //print_r($user);die;
        $row = (new \yii\db\Query())
                        ->select(['*'])
                        ->from('al_admin')
                        ->where(['a_account' =>$name,'a_pwd' =>$pwd])
                       ->all();