admin/frontend/controllers/PersonalController.php

SELECT * FROM `al_personal`
---
    public function actionShow()
    {
        $row=(new\yii\db\Query())
        ->select(['*'])
        ->from('al_personal')
        ->all();