admin/frontend/controllers/RecruitController.php

    public function actionShow()
    {
        $query = (new \yii\db\Query())
            ->select(["(al_post.i_name) as p_name ,(al_place.i_name) as pl_name ,(al_recruit.rec_id) as recr_id  , `r_pay`, `r_describe`, `r_suffer`, `r_edu`, `r_language`, `r_major`, `r_iflogbook`, `r_age`, `r_sex`, `r_name`, `r_time`, `r_addtime`, `r_gen`, `r_status`,`m_name`,`g_price`,`g_type_name`
        "])
            ->from('al_recruit')
            ->leftJoin('al_com_message', 'al_com_message.mes_id = al_recruit.mes_id')
            ->leftJoin('al_generalize', 'al_generalize.gen_id = al_recruit.gen_id')
            ->leftJoin('al_generalize_type', 'al_generalize_type.g_type_id = al_recruit.g_type_id')
            ->leftJoin('al_place', 'al_place.pla_id = al_recruit.pla_id')
            ->leftJoin('al_post', 'al_place.pla_id = al_recruit.pla_id');

                //print_r($query);die;

            $countQuery = clone $query;
            $pages = new Pagination(['totalCount' => $countQuery->count(),'pageSize'=>'5']);

            $models = $query->offset($pages->offset)
                ->limit($pages->limit)
                ->all();
---
SELECT COUNT(*) FROM `al_recruit` LEFT JOIN `al_com_message` ON al_com_message.mes_id = al_recruit.mes_id LEFT JOIN `al_generalize` ON al_generalize.gen_id = al_recruit.gen_id LEFT JOIN `al_generalize_type` ON al_generalize_type.g_type_id = al_recruit.g_type_id LEFT JOIN `al_place` ON al_place.pla_id = al_recruit.pla_id LEFT JOIN `al_post` ON al_place.pla_id = al_recruit.pla_id
SELECT (al_post.i_name) as p_name ,(al_place.i_name) as pl_name ,(al_recruit.rec_id) as recr_id  , `r_pay`, `r_describe`, `r_suffer`, `r_edu`, `r_language`, `r_major`, `r_iflogbook`, `r_age`, `r_sex`, `r_name`, `r_time`, `r_addtime`, `r_gen`, `r_status`,`m_name`,`g_price`,`g_type_name`
         FROM `al_recruit` LEFT JOIN `al_com_message` ON al_com_message.mes_id = al_recruit.mes_id LEFT JOIN `al_generalize` ON al_generalize.gen_id = al_recruit.gen_id LEFT JOIN `al_generalize_type` ON al_generalize_type.g_type_id = al_recruit.g_type_id LEFT JOIN `al_place` ON al_place.pla_id = al_recruit.pla_id LEFT JOIN `al_post` ON al_place.pla_id = al_recruit.pla_id LIMIT 5 OFFSET 5