admin/frontend/controllers/ResumeController.php

SELECT * FROM `al_resume`
---
    public function actionShow()

    {
        //$id=1;
        $row = (new \yii\db\Query())
    ->select(['*'])
    ->from('al_resume')
     ->all();